Autodesk.Revit.DB.Structure.AnalyticalModelColumn.TopExtension
The top extension option.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2015

Autodesk.Revit.DB.Structure.AnalyticalModelColumn.BaseExtension
The base extension option.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2015

Autodesk.Revit.DB.Structure.AnalyticalModelColumn.TopExtensionPlaneId
The top extension plane ID option.
Remarks:
This Plane identifies a Level, a Grid, or a Ref Plane.
To validate plane use Autodesk::Revit::DB::Structure::AnalyticalModelColumn::isPlaneValidForExtension method.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.Structure.AnalyticalModelColumn.BaseExtensionPlaneId
The bottom extension plane ID option.
Remarks:
This Plane identifies a Level, a Grid, or a Ref Plane.
To validate plane use Autodesk::Revit::DB::Structure::AnalyticalModelColumn::isPlaneValidForExtension method.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.Structure.AnalyticalModelColumn.TopExtensionMethod
The top extension method option.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2015

Autodesk.Revit.DB.Structure.AnalyticalModelColumn.BaseExtensionMethod
The bottom extension method option.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2015

Autodesk.Revit.DB.Structure.AnalyticalModelColumn
An element that represents the structural analytical model column.
Since:
2015